import "./index.css";

export const LOAD_STATUS = {
  PROGRESS: "progress",
  SUCCESS: "success",
  ERROR: "error",
};
export function Alert({ message, status = "default" }) {
  return <div className={`alert alert--${status}`}>{message}</div>;
}
export function Loader() {
  return <div className="loader"></div>;
}
export function Skeleton() {
  return (
    <div className="skeleton">
      <div className="skeleton__item"></div>
      <div className="skeleton__item"></div>
      <div className="skeleton__item"></div>
    </div>
  );
}

// Цей файл формує механізм управління статусом запитів з використанням useReducer hook.

// Основний функціонал:

// Формування та управління статусами запитів.
// Встановлення коректних action types для useReducer hook.
// Встановлення даних, message в залежності від статусу запиту.

// Цей файл використовує концепції обробки стану в React (useReducer):

// Декларує константи типів дій, які використовуються в reducerі.
// Оголошує початковий стан запиту (requestInitialState).
// Функція requestReducer: отримує поточний стан та дію, а потім повертає новий стан в залежності від типу дії.

// ### Детальний опис модуля з компонентами та константою

// #### Константа: `LOAD_STATUS`
// - **Опис**: Об'єкт, який містить різні стани завантаження: "progress", "success", "error".
// - **Використання**: Використовується для визначення статусу завантаження у різних частинах програми.

// #### Функція: `Alert`
// - **Параметри**:
//   - `message` (обов'язковий): Повідомлення, яке відображатиметься в спливаючому вікні.
//   - `status` (необов'язковий): Статус сповіщення. Ця властивість грає роль у відображенні сповіщення.
// - **Вміст функції**: Повертає `div` з класом, який визначається відповідно до статусу, та відображає введене повідомлення.

// #### Функція: `Loader`
// - **Вміст функції**: Повертає `div` з класом `loader`.

// #### Функція: `Skeleton`
// - **Вміст функції**: Повертає `div` з класом `skeleton` та три `div` з класом `skeleton__item`.

// Усі ці компоненти відповідають за візуальне відтворення різних елементів інтерфейсу, таких як сповіщення, індикатор завантаження та резервний шаблон. Вони можуть бути використані для відображення сповіщень, індикаторів завантаження та резервних шаблонів під час завантаження або відображення вмісту. Кожен з цих компонентів має властивий клас для стилізації та відображення.

// Модуль містить компоненти, які забезпечують можливість відображення різних елементів інтерфейсу в залежності від стану програми та дій користувача.
